import * as React from "react";
import { KanjiIconType } from "../kanjiIcon";

const Kanji弱: KanjiIconType = (props) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="100%"
    height="100%"
    viewBox="0 0 109 109"
    {...props}
  >
    <g
      style={{
        fill: "none",
        stroke: "#000",
        strokeWidth: 3,
        strokeLinecap: "round",
        strokeLinejoin: "round",
      }}
    >
      <path d="M21.07 18.41c1.68.59 3.68.7 4.79.45 1.11-.24 15.18-2.95 17.47-3.37 2.67-.49 4.33 1.24 3.66 3.18-.47 1.36-2.43 8.74-2.9 12.34" />
      <path d="M21.75 34c.33.33 2.49.88 3.75.77 4.5-.4 14.65-2.02 15.89-2.02 1.56 0 3.11-.5 4.36-.5" />
      <path d="M23.31 35.12c.66.97.81 2.1.38 3.63-.49 1.76-5.26 9.59-5.93 10.32-2.01 2.19-.2 3.41 1.77 2.91 4.72-1.22 19.1-4.23 22.7-4.58 4.02-.39 4.87 2.82 3.92 6.1-4.41 15.26-8.81 29.41-15.53 40.08-2.63 4.17-4.38 2.17-6.22-2.03" />
      <path d="M19 60c3.14.88 8.11 3.62 8.89 4.99" />
      <path d="M12.75 80.61c1.63.98 3.73.8 4.9 0 3.87-2.66 5.78-4.43 12.35-8.49" />
      <path d="M63.32 17.66c1.43.59 3.68.7 4.79.45 1.11-.24 16.44-2.65 18.72-3.12 2.42-.49 4.33 1.24 3.66 3.18-.44 1.3-2.75 8.14-3.81 11.05" />
      <path d="M60.75 33c1.25.62 2.35.36 3.75.17 6.62-.92 17-2.42 19.39-2.67 1.55-.16 3.11-.25 4.36-.25" />
      <path d="M62.31 33.37c.79.79 1.06 1.85.63 3.38-.49 1.76-3.01 9.34-3.68 10.07-2.01 2.19-.2 3.41 1.77 2.91 4.72-1.22 23.17-4.3 26.7-5.08 6.27-1.39 6.17 3.27 5.42 6.6C89.75 66.5 86 82 79.13 94.83c-2.33 4.35-4.38 2.17-6.22-2.03" />
      <path d="M59.74 57.75c3.05 1.13 7.89 5.23 8.65 6.99" />
      <path d="M56 80.92c1.89 1.28 4.3 1 5.68 0 3.85-2.8 6.7-5.77 14.32-11.04" />
    </g>
    <g
      style={{
        fontSize: 8,
        fill: "gray",
      }}
    >
      <text transform="translate(14.25 19.63)">{"1"}</text>
      <text transform="translate(27.75 31.63)">{"2"}</text>
      <text transform="translate(15.75 42.13)">{"3"}</text>
      <text transform="translate(9.75 64.63)">{"4"}</text>
      <text transform="translate(6.75 88.63)">{"5"}</text>
      <text transform="translate(56.25 15.13)">{"6"}</text>
      <text transform="translate(66.75 30.13)">{"7"}</text>
      <text transform="translate(54.75 39.13)">{"8"}</text>
      <text transform="translate(51.75 64.63)">{"9"}</text>
      <text transform="translate(45.75 88.63)">{"10"}</text>
    </g>
  </svg>
);

export default Kanji弱;
