import * as React from "react";
import { SVGProps } from "react";

const Kanji縫 = (props: SVGProps<SVGSVGElement>) => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="100%"
    height="100%"
    viewBox="0 0 109 109"
    {...props}
  >
    <g
      style={{
        fill: "none",
        stroke: "#000",
        strokeWidth: 3,
        strokeLinecap: "round",
        strokeLinejoin: "round",
      }}
    >
      <path d="M66.58 12.75c.04.54.16 1.41-.08 2.17C65 19.75 60 28.75 52.75 35.67" />
      <path d="M66.25 19.74c.25.03 1.78.45 2.48.38 2.32-.25 10.14-1.91 13.45-2.69 2.27-.54 2.92.61 2.34 2.07-3.19 7.99-19.37 22.79-33.56 26.91" />
      <path d="M60.42 27.53c3.57-.02 24.72 10.19 30.54 12.25 1.73.61 3.14.91 4.83 1.1" />
      <path d="M60.67 50.68c.74.34 2.1.42 2.83.34 8.55-.94 16.59-2.08 23.72-2.98 1.22-.15 1.97.16 2.59.33" />
      <path d="M60.76 61.88c.74.34 2.6.42 3.33.34 8.55-.94 15.84-1.58 22.97-2.48 1.22-.16 1.97.16 2.59.33" />
      <path d="M57.74 74.55c1.24.57 3.49.62 4.73.57 7.78-.37 18.78-2.62 28.95-3.57 2.05-.19 3.29.27 4.32.55" />
      <path d="M73.81 40.94c.61.36 2.02 2.06 2.02 3.42 0 7.55-.25 32.54-.25 42.23" />
      <path d="M39.46 22.5c2.84 1.44 7.33 5.9 8.04 8.13" />
      <path d="M39 57.22c2.04.93 3.39.46 4.3.23.9-.23 5.88-3.25 7.24-3.71 1.36-.46 3.39 1.16 2.49 2.55s-5.12 6.31-5.8 7.47c-.68 1.16-1.95 2.25-.6 3.87 1.36 1.62 3.99 5.89 4.67 7.28.68 1.39.68 2.55-.68 3.71-1.36 1.16-6.64 6.65-8 7.12" />
      <path d="M37.25 87.15c2.28-.35 6.84-1.21 10.27-.52 3.42.69 22.87 5.33 26.23 6.22 9.12 2.42 16.16 3.11 23 1.9" />
      <path d="M23.45 14.25c.28 1.42.35 2.5-.14 4.02-2.47 7.66-5.41 13.2-8.41 19.61-.4.86-.56 3.28 0 3.55 2.95 1.42 7.08 3.78 9.61 6.38" />
      <path d="M33.96 27.03c.26.64.34 2.75 0 3.43-5 10.06-12.44 24.07-19.31 33.25-1.57 2.1.39 3.31 1.42 2.88 4.29-1.79 13.2-4.99 18.72-6.7" />
      <path d="M31.22 51.61c2.23 2.58 5.76 10.59 6.32 14.59" />
      <path d="M10.46 79.64c3.39 3.22 5.98 10.7 6.77 13.61" />
      <path d="M20.16 75.48c3.84 2.79 6.78 9.27 7.67 11.8" />
      <path d="M29.87 70.54c3.72 2.24 6.58 7.43 7.45 9.46" />
    </g>
    <g
      style={{
        fontSize: 8,
        fill: "gray",
      }}
    >
      <text transform="translate(17.5 15.5)">{"1"}</text>
      <text transform="translate(27.5 27.5)">{"2"}</text>
      <text transform="translate(30.5 49.5)">{"3"}</text>
      <text transform="translate(4.5 80.5)">{"4"}</text>
      <text transform="translate(14.5 77.5)">{"5"}</text>
      <text transform="translate(24.5 73.5)">{"6"}</text>
      <text transform="translate(59.5 12.5)">{"7"}</text>
      <text transform="translate(71.5 16.5)">{"8"}</text>
      <text transform="translate(68.5 27.5)">{"9"}</text>
      <text transform="translate(51.5 52.5)">{"10"}</text>
      <text transform="translate(60.5 59.91)">{"11"}</text>
      <text transform="translate(55.5 71.5)">{"12"}</text>
      <text transform="translate(65.5 46.5)">{"13"}</text>
      <text transform="translate(35.5 19.63)">{"14"}</text>
      <text transform="translate(37.5 54.05)">{"15"}</text>
    </g>
  </svg>
);

export default Kanji縫;
